{
  "__tls_get_addr": "Same trap pattern as `lzma_check_init`: the compiled object ships a dummy `__tls_get_addr` that halts if invoked. The loader\nadjusts the GOT to point at `j_tls_get_addr` (and eventually the host's resolver); leaving this stub in place makes unexpected\nexecution obvious and prevents the payload from silently calling an incomplete resolver.",
  "_cpuid_gcc": "GCC-style CPUID shim that dispatches through the individual helper thunks for every supported leaf (basic, cache, topology,\nextended brand strings, etc.). Whatever leaf pointer it chooses has EAX/EBX/ECX/EDX copied into the provided outputs so callers\ndon’t need inline assembly.",
  "_get_cpuid_modified": "Wrapper around `_cpuid_gcc` that first invokes `backdoor_entry` with the high-bit leaf to make sure the loader ran, checks the\nreturned maximum leaf, and only executes the requested CPUID if the CPU claims to support it. This is the exported symbol glibc\nbinds, so the loader’s work is triggered before any sshd thread asks for cpuid data.",
  "backdoor_entry": "IFUNC resolver entry point. It increments a global invocation counter, calling `backdoor_init()` on the second pass so the\nloader can stage its hooks while glibc thinks it is still choosing a cpuid implementation. Regardless of setup, it finally\ndelegates to `_cpuid_gcc` to satisfy liblzma’s original resolver contract.",
  "backdoor_init": "Converts the IFUNC entry context into a GOT patch: it initialises the GOT bookkeeping, locates the cpuid GOT slot via\n`update_got_address`, swaps the resolver pointer to `backdoor_init_stage2`, calls the genuine cpuid to finish initialisation,\nand then restores the slot back to its original target so future calls run the attacker’s resolver without tripping sanity\nchecks.",
  "backdoor_init_stage2": "Runs inside the hijacked cpuid resolver. It builds temporary `backdoor_shared_globals_t`, `backdoor_hooks_ctx_t`, and\n`backdoor_setup_params_t` objects, repeatedly calls `init_hooks_ctx()` until the shared globals are available, and then hands\nthe bundle to `backdoor_setup`. If setup succeeds it never returns (the hooks stay installed); if setup fails it zeroes the GOT\ncontext and falls back to issuing a real CPUID so liblzma’s resolver still fulfils glibc’s contract.",
  "backdoor_setup": "The loader’s main workhorse. It snapshots the caller’s GOT/stack, builds a local `backdoor_data_t` describing all observed\nmodules, resolves sshd/libcrypto/liblzma/libc/ld.so via `process_shared_libraries`, initialises the shared globals, and pulls in\nthe `backdoor_hooks_data_t` blob sitting inside liblzma. With those pieces it refreshes the string-reference catalogue,\nconfigures the global context (payload buffers, sshd/log contexts, import tables), runs the sensitive-data + sshd-metadata\ndiscovery routines, and finally rewires ld.so’s audit tables so `backdoor_symbind64` is invoked for every sshd→libcrypto PLT\ncall. On success it copies the updated hook table back into liblzma and leaves the cpuid GOT slot ready to resume execution.",
  "bignum_serialize": "Normalises a BIGNUM into the [len||value] format used by the fingerprinting code. It caps inputs at 0x4000 bits, emits a 4-byte\nbig-endian length, copies the magnitude, and prepends a zero byte (or memmoves the data) whenever the top bit would otherwise\nmake the number negative so SHA-256 sees a canonical stream.",
  "c_memmove": "Private implementation of `memmove` so the object never has to import libc for something this trivial. It detects backwards\noverlap (`src < dest < src+cnt`) and copies from the end towards the beginning in that case; every other scenario devolves into\na forward copy loop. Either way the original `dest` pointer is returned so callers can chain copies just like they would with\nthe libc version.",
  "c_strlen": "Tiny strlen implementation that stage two uses before libc is trustworthy. It simply walks the buffer one byte at a time and\nreturns the length as a signed size, allowing other helpers to sanity-check argv/envp strings without resolving libc symbols.",
  "c_strnlen": "Bounded strlen variant used when scanning attacker-controlled buffers. It stops as soon as it sees a NUL or reaches `max_len`,\nreturning the limit unchanged if the string is unterminated so callers can treat that as an error.",
  "chacha_decrypt": "Checks the caller supplied pointers/lengths, verifies that the EVP entries in imported_funcs are non-null\n(contains_null_pointers), allocates an EVP_CIPHER_CTX, and runs EVP_chacha20 through Init/Update/Final. The helper enforces that\nthe final output length never exceeds the input, frees the context on every path, and reports TRUE only when all EVP calls\nsucceed.",
  "check_argument": "Sanity-checks a dash-prefixed argv entry by sliding a two-byte window across it and immediately returning the current\npointer when either byte is the lowercase letter `d`. `process_is_sshd` treats that non-null result as grounds to abort,\nwhich keeps the implant out of sshd instances started with `-d`, `--debug`, or any argument that embeds a lowercase\ndebug flag. Arguments containing control characters or `=` bail out of the loop without ever tripping the match, so only\nthe specific `-d` style switches are rejected.",
  "check_backdoor_state": "Enforces the payload assembly state machine kept in `global_context_t`: states 1 and 2 require a populated\n`sshd_payload_ctx`, at least 0xae bytes buffered, and a sane body_length lifted from the decrypted header (including\nroom for the 0x60-byte trailer). State 0 insists that the staging buffer stays smaller than 0xae bytes, while state 3/4\naccept only those literal values. Any mismatch resets `payload_state` to 0xffffffff so the caller knows to discard\npartially buffered data.",
  "contains_null_pointers": "Linear check used before invoking crypto helpers. Given an array of pointers and a count, it reports 1 as soon as it encounters\na NULL slot, letting callers bail out if any required import failed to resolve.",
  "count_bits": "Wegner-style popcount loop over a 64-bit mask. The trie walker and the secret-data helpers use it to turn bitmap nodes into\nchild indexes without storing per-node counts.",
  "count_pointers": "Uses `malloc_usable_size()` to measure a pointer array and counts consecutive non-NULL entries until it hits either a NULL or\nthe allocation boundary. Sensitive-data heuristics call it when walking sshd tables whose length isn’t stored explicitly.",
  "decrypt_payload_message": "Decrypts a ChaCha-wrapped `key_payload_t` chunk using the attacker-provided key material returned by\n`secret_data_get_decrypted`. If the header/body lengths are sane and there is enough space left in `ctx->payload_data`,\nit copies the plaintext body into the staging buffer, bumps `current_data_size`, and then replays the decryption a\nsecond time so the ChaCha keystream stays aligned with sshd's original consumer. Any failure (bad lengths, short\ndecrypts, exhausted buffer) forces `payload_state` back to 0xffffffff so future packets start from a clean slate.",
  "dsa_key_hash": "Pulls the p/q/g parameters and public key (y) out of the DSA handle via DSA_get0_pqg/DSA_get0_pub_key, serialises each with\nbignum_serialize into a 0x628-byte scratch buffer, and hashes the concatenation with sha256. Any missing pointer, oversized\nBIGNUM, or serialization failure aborts immediately so only genuine DSA host keys feed the fingerprint.",
  "elf_contains_vaddr": "Thin wrapper around `elf_contains_vaddr_impl` that keeps the public API surface simple. Every range-checker in the loader\nfunnels through it so the flag handling, recursion guard, and alignment fixes stay centralized, making it easy to detect when a\npointer falls outside the parsed ELF image.",
  "elf_contains_vaddr_impl": "Validates that `[vaddr, vaddr + size)` is entirely covered by one or more PT_LOAD segments whose `p_flags` mask includes the\nrequested bits. The helper page-aligns both ends of the interval, walks every loadable program header, and recurses when the\nrange straddles multiple segments so partial overlaps are rechecked piecemeal.\n\nIt refuses to run more than 0x3ea iterations (preventing runaway recursion), insists that the candidate addresses live inside\nthe mapped ELF image, and short-circuits to TRUE when `size` is zero. Callers pass `p_flags` values such as PF_X or PF_W to\ndifferentiate text, data, and RELRO spans.",
  "elf_contains_vaddr_relro": "Combines `elf_contains_vaddr` with the GNU_RELRO metadata harvested during `elf_parse`. The range must sit inside a read-only\nPT_LOAD (PF_R), and the module must have advertised a RELRO segment; if so the helper also verifies that `[vaddr, vaddr+size)`\nfalls within the page-aligned RELRO window cached in `elf_info_t`. Anything outside that protected span returns FALSE, which\nprevents the loader from treating writable data as RELRO by mistake.",
  "elf_find_function_pointer": "Given a populated string-reference entry, copies its `func_start`/`func_end` and searches RELA (then RELR) for a relocation that targets the function, treating the relocation address as the writable function-pointer slot.\nThe slot must live in RELRO (`elf_contains_vaddr_relro` enforces this); if the runtime flagged ENDBR usage, the referenced code is revalidated with `is_endbr64_instruction` before returning TRUE.\nReturns FALSE when the xref is missing, no relocation is found, or the slot is outside RELRO.",
  "elf_find_rela_reloc": "Searches the RELA relocation array for an entry tied to a given code pointer. When `encoded_string_id` is non-zero it is treated\nas an absolute address inside the module: the helper subtracts `elfbase` to match against `r_addend` and, on success, returns\nthe relocated slot at `r_offset`. When the argument is zero the caller instead wants the raw addend pointer, so the helper\nimmediately returns `elfbase + r_addend`.\n\nA pair of optional range bounds and a resumption index can be supplied in the additional SysV argument registers; if present\nthey force the returned address to fall inside `[low, high]` and let the caller continue scanning from the previous index.\nFailing to find a match (or discovering that the module never exposed RELA relocations) yields NULL and, if a cursor pointer was\nprovided, stores the position it stopped at.",
  "elf_find_relr_reloc": "Performs the same search as `elf_find_rela_reloc` but against the packed RELR format. It replays the RELR decoding algorithm\n(literal entry vs bitmap entry), sanity-checks each decoded pointer with `elf_contains_vaddr`, compares the pointed-to value\nagainst the requested target address, and optionally enforces a lower/upper bound plus an iteration cursor via the extra\nargument registers. Returning NULL means there were no RELR records, the address never appeared in the run, or one of the\ndecoded pointers failed validation.",
  "elf_find_string": "Iterates through the cached `.rodata` window, calling `get_string_id` on each byte offset until it encounters a recognizable encoded string. If `*stringId_inOut` is zero the first discovered string wins and its id is written back; otherwise the search continues until an exact id match is found. The optional `rodata_start_ptr` lets callers resume from a previous location or constrain the search to a suffix of the segment.\n\nThe scan is gated by `secret_data_append_from_call_site`: if the telemetry helper returns FALSE the routine skips the walk entirely, ensuring rodata scrapes are always reflected in the secret-data log.\n",
  "elf_find_string_reference": "Single-shot helper for the string catalogue that emits secret-data telemetry, then iterates `elf_find_string` until the requested `encoded_string_id` is found.\nFor each occurrence it invokes `find_string_reference` between `code_start` and `code_end`, returning the first instruction that materialises the literal or NULL if none exist in that range.",
  "elf_find_string_references": "Builds the 27-entry `string_references_t` catalogue used by the loader heuristics.\nSeeds each entry with its `EncodedStringId`, walks .rodata via `elf_find_string`, and records the first LEA that materialises each literal with `find_string_reference`.\nThen sweeps `.text` with `x86_dasm`, tightening each entry's `func_start`/`func_end` around calls, PLT/JMP stubs, and RIP-relative LEAs that target the recorded xrefs, and finally reconciles the ranges against RELA/RELR relocations and the code-segment bounds so later scans can trust the table.",
  "elf_get_code_segment": "Finds and caches the first executable PT_LOAD segment. The routine walks the program headers until it sees a segment with PF_X set, computes the runtime address by subtracting the ELF's minimum virtual address from `p_vaddr`, page-aligns both ends, stores the start/size inside `elf_info_t`, and returns the aligned base while writing the computed size through `pSize`. Subsequent calls use the cached values to avoid rescanning the headers.\n\nBefore touching the headers it emits a `secret_data_append_from_address` telemetry record and refuses to proceed if that hook fails, keeping the text-range discovery tied to the secret-data accounting path.\n",
  "elf_get_data_segment": "Walks every PT_LOAD segment looking for the last read/write mapping (PF_W|PF_R). Once found it caches three pieces of\ninformation: the base of the mapped data (`data_segment_start`), the amount of padding between the end of the file-backed bytes\nand the next page boundary (`data_segment_alignment`), and the total size of the aligned segment. Callers either request the\ntrue segment span (`get_alignment == FALSE`) or the padding region (when TRUE), which is where the implant later tucks the\n`backdoor_hooks_data_t` structure.",
  "elf_get_got_symbol": "Identical pattern but aimed at the main RELA table: it requires `flags & 2` (meaning RELA records were found) and then calls\n`elf_get_reloc_symbol` with relocation type 6 (R_X86_64_GLOB_DAT). Successful lookups hand back the writable GOT slot for the\nsymbol so the loader can redirect it; failure means the symbol was not imported through a GOT relocation.",
  "elf_get_plt_symbol": "Looks up the PLT thunk for a given symbol by delegating to `elf_get_reloc_symbol` with relocation type 7 (R_X86_64_JUMP_SLOT).\nIt first makes sure the module actually advertised a PLT relocation table (flag bit 1) and caches its size, then returns the\nGOT/PLT entry that will be overwritten during hook installation. NULL means either the relocation table was absent or the\nrequested symbol never appeared there.",
  "elf_get_reloc_symbol": "Generic helper that scans an arbitrary relocation array for undefined symbols of a specific relocation type (e.g., GOT vs PLT) and a specific encoded name. It iterates through `num_relocs`, ensures the relocation type matches `reloc_type`, confirms the associated symbol is really an import (`st_shndx == 0`), and then resolves the symbol name via `get_string_id` before comparing it to `encoded_string_id`. When it finds a match it returns the relocated address (`elfbase + r_offset`) so the caller can patch GOT/PLT entries in place.\n\nEach call starts by logging the lookup with `secret_data_append_from_address`, and it immediately aborts if the telemetry helper reports failure. That keeps relocation patching tied to the secret-data accounting path so the loader never quietly rewrites GOT/PLT entries when the recorder is disabled.\n",
  "elf_get_rodata_segment": "Locates the first read-only PT_LOAD segment that lives entirely after the executable code. It first asks `elf_get_code_segment` for the text range so it can ignore overlapping pages, then scans for PF_R-only segments, page-aligns their bounds, and picks the lowest segment whose start is beyond the end of `.text`. The result is cached in `elf_info_t` and handed to callers alongside its size so later routines (string searches, RELRO probes) can reuse the computed window.\n\nThe helper begins by logging a `secret_data_append_from_call_site` record; failure to emit that telemetry causes the search to abort, so the rodata queries only run when the secret-data recorder is active.\n",
  "elf_parse": "Initialises an `elf_info_t` from an in-memory ELF header: zeroes every field, records the lowest PT_LOAD virtual address,\nlocates the PT_DYNAMIC segment, and caches pointers to the strtab, symtab, relocation tables (PLT, RELA, RELR), GNU hash\nbuckets, version records, and GNU_RELRO metadata. Each pointer retrieved from the dynamic table is validated with\n`elf_contains_vaddr` so forged headers are rejected.\n\nIt also enforces invariants such as 'only one PT_GNU_RELRO segment', derives the number of dynamic entries, and flips feature\nbits (`flags`) so later helpers know whether RELR, versym, or gnurelro data is present. Failure to locate the dynamic segment,\nfind the required headers, or keep derived pointers inside mapped memory causes the parse to abort with FALSE.",
  "elf_symbol_get": "Symbol resolver that trusts the GNU hash table the loader extracted earlier. After setting a telemetry bit it walks each hash\nbucket, validates the bucket and chain addresses, and replays the classic GNU hash lookup to pull `Elf64_Sym` entries out of\n`.dynsym`. When a candidate symbol has a non-zero value and section index, the helper hashes the associated string with\n`get_string_id` and compares it against the requested encoded id.\n\nIf a symbol version is supplied it additionally consults `.gnu.version`/`.gnu.version_d`: the version index is read from\n`versym`, then matched against the verifier definitions by walking the linked `verdef` list and comparing the underlying string\nid. Returning NULL means either the target symbol is missing, the module did not advertise GNU hash+version tables, or the\nstring/relocation pointers failed validation.",
  "elf_symbol_get_addr": "Convenience layer on top of `elf_symbol_get`: look up the symbol, make sure it is defined (both `st_value` and `st_shndx` are\nnon-zero), and then turn the symbol value into a process address by adding it to `elf_info->elfbase`. Returning NULL indicates\neither the symbol does not exist or it represents an import/resolver stub that lacks a concrete address.",
  "extract_payload_message": "Searches an sshbuf blob for either `\"ssh-rsa-cert-v01@openssh.com\"` or `\"rsa-sha2-256\"`, using the surrounding length\nfields (all big-endian) to walk the serialized key structure. It validates every intermediate length (capping them at\n0x10000), ensures the proposed modulus chunk fits within the caller-provided buffer, and rewrites `sshbuf->d` to point\ndirectly at that modulus blob. The extracted length is returned via `out_payload_size` so the decryptor knows exactly\nhow many bytes to peel off.",
  "fake_lzma_alloc": "Companion to `fake_lzma_free` that turns the liblzma allocation API into a symbol resolver. The `opaque` parameter is treated as\nan `elf_info_t *`, the requested `size` is reinterpreted as an `EncodedStringId`, and it simply returns whatever\n`elf_symbol_get_addr()` produces. The `nmemb` argument is ignored because the helper is never asked to allocate real memory—it\nonly masquerades as an allocator long enough to bootstrap symbol lookups inside ld.so.",
  "fake_lzma_free": "No-op placeholder that exists solely to satisfy the liblzma allocator interface the implant exposes. The loader wires this stub\ninto `lzma_allocator.free` until it can swap in the genuine host callbacks, so any invocation is guaranteed to do nothing other\nthan prove that the fake allocator is still active.\n\nHaving an inert body keeps the import surface small while still exporting a correctly typed symbol, and it gives the runtime a\nreliable indicator that a caller incorrectly tried to free memory through the bootstrap allocator.",
  "fd_read": "Wraps libc’s read with retry logic. It refuses to run without both `read` and `__errno_location`, loops on EINTR, and aborts\nwith -1 when the helper sees EOF before the requested byte count. Successful reads consume the entire length so callers can\ntreat any non-zero return as \"buffer filled\".",
  "fd_write": "Mirror of `fd_read`: it requires valid write/errno pointers, retries on EINTR, and treats short writes as fatal so callers\neither send the entire buffer or receive -1. It is the plumbing used whenever the implant forges monitor messages.",
  "find_add_instruction_with_mem_operand": "Specialised scanner for `add [mem],reg`: decodes forward byte-by-byte until opcode `0x103` appears with a memory ModRM form.\nWhen `mem_address` is supplied it also requires DF2 to show a displacement and the recomputed RIP-relative address to match.\nReturns TRUE with `dctx` still on the ADD so callers can read the increment immediate.",
  "find_addr_referenced_in_mov_instruction": "Walks the function owning a string reference, repeatedly calling `find_instruction_with_mem_operand_ex` for opcode `0x10b` to find MOV loads that touch data.\nSkips register-only forms and 64-bit REX.W MOVs, recomputes the absolute address for displacement-based operands (RIP-relative when ModRM encodes it), and returns the first address that falls inside `[mem_range_start, mem_range_end)`.\nReturns NULL when no qualifying reference is found or when register-only forms surface and no range was requested.",
  "find_call_instruction": "Emits a secret-data telemetry record, then decodes forward using a scratch or caller-supplied context.\nDecode failures advance a single byte; successes advance by `instruction_size` until the normalised CALL opcode (`0x168`) is seen, and when `call_target` is provided the rel32 destination (`instruction + instruction_size + operand`) must match it.\nReturns TRUE with `dctx` still describing the CALL so hook installers can patch immediately after it.",
  "find_dl_audit_offsets": "Coordinates the entire ld.so reconnaissance pass. It resolves the necessary EC/EVP helpers via the fake allocator, copies\n`_dl_audit_symbind_alt`’s address/size out of ld.so, and uses `find_link_map_l_name` to compute the displacement between the\ncached and live link_map entries. With that offset it invokes `find_dl_naudit` to capture the `_dl_naudit`/`_dl_audit` pointers\nand `find_link_map_l_audit_any_plt` to learn where the audit bit lives. Finally it copies libcrypto’s basename into\n`hooks->ldso_ctx` so the forged `l_name` string looks correct. Any failure frees the temporary imports and aborts the audit-hook\ninstall path.",
  "find_dl_naudit": "Harvests the `_dl_naudit` counter and `_dl_audit` pointer from ld.so so the loader can toggle audit modules. After resolving\n`DSA_get0_pqg`, `DSA_get0_pub_key`, and `EVP_MD_CTX_free` via the fake allocator, it finds `rtld_global_ro`, searches for the\n`GLRO(dl_naudit)` string reference, and decodes the MOV that loads that slot. The same memory address is then matched inside\n`_dl_audit_symbind_alt`; if the MOV/TEST pair is found and the slot is still zero, the function records the `_dl_naudit` and\n`_dl_audit` pointers in `hooks->ldso_ctx`. Any deviation or pre-existing audit module aborts the attempt.",
  "find_function": "Recovers function bounds around an instruction.\nWith `func_start` non-null it scans backward toward `search_base`, checking every byte with `find_function_prologue`; failing to find a match or hitting `search_base` without one aborts.\nWith `func_end` it scans forward to the next prologue (or `code_end`) and uses that address as the end marker, yielding dependable start/end pointers for later string/reloc walkers.",
  "find_function_prologue": "Validates that an address matches the requested prologue form.\nFor `FIND_ENDBR64` it zeros a decoder, runs `x86_dasm`, requires the ENDBR64 opcode, and only succeeds if the pad ends on a 16-byte boundary (returning the first post-pad instruction through `output`).\nIn legacy mode it calls `is_endbr64_instruction` with the simple mask and, on success, returns the prologue address itself so callers can sweep until a match is found.",
  "find_instruction_with_mem_operand": "Chases an absolute address without exposing the LEA vs MOV distinction: first tries `find_lea_instruction_with_mem_operand`, then falls back to `find_instruction_with_mem_operand_ex` for opcode `0x10b` (MOV load) if the LEA path fails.\nTRUE means `dctx` now describes an instruction that touches `mem_address`.",
  "find_instruction_with_mem_operand_ex": "Generic predicate for locating a specific `opcode` that reads/writes memory.\nDecodes forward (scratch context if needed), requires a memory ModRM form, and when `mem_address` is non-null also requires DF2 to indicate a displacement operand and the RIP-relative address (`instruction + instruction_size + mem_disp`) to equal that address.\nOn success it leaves `dctx` populated so callers like the add/mov/addr scanners can inspect operands without re-decoding.",
  "find_lea_instruction": "Telemetry-backed search for LEA instructions that materialise a specific displacement.\nSlides one byte at a time, requires opcode `0x10d`, demands DF2 report a plain displacement operand, and treats `displacement` and `-displacement` as equivalent so mirrored scans still qualify.\nReturns TRUE with the stack-resident decoder context describing the LEA when found.",
  "find_lea_instruction_with_mem_operand": "LEA finder that insists the instruction truly references memory: waits for opcode `0x10d` with REX.W set and a memory ModRM form, using a scratch decoder when the caller passes NULL.\nIf `mem_address` is supplied it replays the RIP-relative calculation (`instruction + instruction_size + mem_disp`) and only succeeds on an exact match, returning with `dctx` still on the LEA.",
  "find_link_map_l_audit_any_plt": "Primes an `instruction_search_ctx_t` before invoking the bitmask helper. It sweeps `_dl_audit_symbind_alt` for the LEA that\nmaterialises `link_map::l_name` using the caller-provided displacement, records which registers capture the pointer versus the\nmask, initialises the register filters/output buffers, and then calls `find_link_map_l_audit_any_plt_bitmask`. Success means\nboth the byte offset and AND mask are now stored in `hooks->ldso_ctx`; failure either means the pattern never appeared or the\nbit was already non-zero.",
  "find_link_map_l_audit_any_plt_bitmask": "Takes the displacement from `find_link_map_l_name` and hunts for the byte and mask that back ld.so’s `link_map::l_audit_any_plt`\nflag. It temporarily resolves `EVP_DecryptInit_ex` and libc’s `getuid`, decodes `_dl_audit_symbind_alt` with `x86_dasm`, and\ntracks which register holds the computed pointer. Once it sees the MOV-from-link_map followed by a TEST/BT it validates that the\nmask is a single set bit, records the absolute address in `hooks->ldso_ctx.sshd_link_map_l_audit_any_plt_addr`, stores the byte-\nwide mask, and insists the bit is still clear; otherwise the helper sets the search context’s `result` flag and bails out.",
  "find_link_map_l_name": "Locates the live `link_map::l_name` byte inside ld.so and gathers the libc/libcrypto imports needed later in the run. It\npiggybacks on the fake `lzma_alloc` resolver to look up `exit`, `setlogmask`, `setresgid`, `setresuid`, `system`, `shutdown`,\nand `BN_num_bits`, then walks the cached liblzma link_map snapshot inside the binary until it finds the entry whose RELRO tuple\nmatches the running liblzma image. The resulting displacement becomes both `*libname_offset` and the pointer used to index\n`hooks->ldso_ctx.libcrypto_l_name`, and the helper double-checks that `_dl_audit_symbind_alt` references the same offset so\nlater code can safely rewrite the `l_name` field when posing as an audit module.",
  "find_mov_instruction": "MOV-only variant of the pointer scan: decodes sequentially, requires the memory↔register ModRM form, enforces the REX.W width test when `is_64bit_operand` is TRUE (waived for stores), and accepts only opcode `0x10b` (load) or `0x109` (store) per `load_flag`.\nDecode failures advance one byte; otherwise the loop walks by `instruction_size`, returning TRUE with `dctx` on the matching MOV.",
  "find_mov_lea_instruction": "Scans for pointer-producing MOV/LEA instructions that use the expected memory ModRM shape.\nEach decode must either be LEA (`0x10d`) or the MOV opcode selected by `load_flag` (`mov reg,[mem]` vs `mov [mem],reg`), and the REX.W bit must agree with `is_64bit_operand` unless the caller is searching for stores.\nOn success `dctx` remains on the instruction so pointer-chasing helpers can read back operands and addressing.",
  "find_reg2reg_instruction": "Requires a caller-supplied decoder context and walks instructions until it finds a pure register-to-register transfer.\nAccepts MOV reg↔reg plus a masked set of arithmetic-immediate opcodes, but rejects any lock/rep prefixes, REX.W/B bits, or ModRM modes other than 3.\nReturns TRUE with `dctx` still on the shuffle; decode failures or reaching `code_end` return FALSE so pointer propagation routines know no memory was touched.",
  "find_string_reference": "Zeroes a scratch decoder and asks `find_lea_instruction_with_mem_operand` to locate the first LEA in `[code_start, code_end)` that materialises the absolute address `str`.\nReturns the LEA's address as the xref anchor or NULL when no such reference exists.",
  "get_elf_functions_address": "Same pattern for the `elf_functions_t` dispatch table: start from the relocation-safe sentinel (`elf_functions_offset` lives\nnear `fake_lzma_allocator_offset` in `.data`) and advance 12 struct slots to arrive at the live table. The convoluted pointer\nmath lets the object carry offsets instead of absolute addresses, which keeps the relocation surface tiny while still giving the\nloader a stable way to reach its helper vtable.",
  "get_lzma_allocator": "Returns the `lzma_allocator` sub-structure embedded inside the fake allocator blob. Callers use it when they need to hand\nliblzma-style callbacks to another routine (e.g., passing an allocator into a liblzma API) while still pointing `opaque` at the\nimplant's `elf_info_t`.",
  "get_lzma_allocator_address": "Manual pointer arithmetic that recovers the runtime address of the fake `fake_lzma_allocator_t` blob without requiring\nrelocatable absolute addresses. The compiler emits a sentinel (`fake_lzma_allocator`) followed by padding, so this helper starts\nat that symbol and steps through the struct 12 times, effectively adding the baked-in 0x160-byte offset that lands on the real\nallocator instance the loader populated at build time.",
  "get_string_id": "Maps runtime strings to EncodedStringId identifiers without shipping plaintext literals. Each call logs itself via\nsecret_data_append_from_address, clamps the scan to 0x2c bytes, and walks two packed bitmaps (_Lcrc64_clmul_1+0x760 and the\nstring_action_data trie) while repeatedly calling count_bits to compute the next child index. It returns the encoded ID when it\nreaches a terminal node or 0 when the bytes miss the trie, and is used to find SSH banner strings during sshd heuristics.",
  "get_tls_get_addr_random_symbol_got_offset": "Seeds `ctx->got_ctx.tls_got_entry` and `ctx->got_ctx.got_base_offset` with the canned values associated with the fake `__tls_get_addr`\nsymbol. The loader uses those numbers as the starting point for `update_got_address`, which refines them into the concrete GOT\nentry address.",
  "hook_EVP_PKEY_set1_RSA": "Tap point for EVP_PKEY_set1_RSA so the backdoor sees every RSA handle even when the decrypt hook never fires. It simply calls\nrun_backdoor_commands on the key and then invokes the preserved OpenSSL routine.",
  "hook_RSA_get0_key": "Mirrors the same idea for RSA_get0_key: every consumer that asks OpenSSL for the modulus/exponent triggers run_backdoor_commands\nfirst, letting the implant inspect/track the RSA handle before delegating to the original function.",
  "hook_RSA_public_decrypt": "Replacement for RSA_public_decrypt: it ensures the PLT pointer is resolved, hands the RSA key to run_backdoor_commands (passing\na do_orig flag by reference), and either returns the backdoor’s result or forwards the call to the genuine OpenSSL symbol\ndepending on whether the dispatcher consumed the ciphertext.",
  "init_elf_entry_ctx": "Seeds an `elf_entry_ctx_t` prior to running the IFUNC resolvers. It records the address of `cpuid_random_symbol`, captures the\ncaller's return address from the saved frame (slot 3), recomputes the GOT anchor offset via `update_got_offset`, primes the\ncpuid GOT index with `update_cpuid_got_index`, and clears the cached `tls_got_entry` so the resolver will refill it. The context\nis later consumed by the GOT patching code that splices the malicious cpuid stub into sshd.",
  "init_hooks_ctx": "Primes a transient `backdoor_hooks_ctx_t` before stage two patches the GOT. It always points `hooks_data_addr` at the\n`hooks_data` blob baked into liblzma, zeros the scratch flags, and, when `ctx->shared` is still NULL, drops in the static hook\nentry points (`backdoor_symbind64`, the RSA shims, and the mm_* monitor hooks) before returning 0x65 so the caller can retry\nafter the shared globals are published. Once the shared block exists it simply returns 0, signalling that the structure now\ninherits every pointer from the shared globals.",
  "init_imported_funcs": "Sanity-checks the OpenSSL import table before the hooks are allowed to run. It requires `resolved_imports_count` to equal 0x1d\nand then inspects the `RSA_public_decrypt`, `EVP_PKEY_set1_RSA`, and `RSA_get0_key` PLT shims. If at least one of them is\nresolved it returns TRUE so later code can jump through the host's libcrypto. When all three slots are still NULL it plants\n`backdoor_init_stage2` / `init_shared_globals` in the RSA entries as crash-safe fallbacks and returns FALSE so stage two keeps\nwaiting until the imports are ready.",
  "init_ldso_ctx": "Restores every ld.so flag the implant may have touched: it writes the saved auditstate bindflags back to libcrypto/sshd, unsets\nthe copied `l_name` byte, clears the `l_audit_any_plt` bit with the mask recovered earlier, and zeros `_dl_naudit`/`_dl_audit`\nso the dynamic linker no longer believes an audit module is registered. Stage two calls it on failure paths so sshd resumes with\nthe original ld.so state.",
  "init_shared_globals": "Seeds the shared global block with the mm/EVP hook entry points and a pointer to the lone `global_ctx` instance. Every hook\nconsults this block at runtime, so the function simply wires the exported function pointers into the struct and returns success\nonce the pointer checks pass.",
  "is_endbr64_instruction": "Guards that at least four bytes remain and then compares the dword at `code_start` against ENDBR64, or'd with the caller-supplied `low_mask_part` so both CET prefix variants collapse to a single equality test.\nUsed by the prologue finders to cheaply vet potential landing pads before accepting them as function entries.",
  "is_gnu_relro": "Obfuscated equality test for PT_GNU_RELRO. Instead of comparing `p_type` directly against `0x6474e552`, the code adds the caller\nsupplied `addend` (always `0xa0000000`) and checks for the magic constant, which makes the instruction stream look less like a\nstraightforward RELRO probe in the object file.",
  "is_range_mapped": "Userland page-probe that avoids importing `mincore(2)`. The helper aligns the requested address downward, then walks one page at\na time toward `addr + length`, invoking the host's `pselect` with NULL fd sets and the page pointer passed in as the signal mask\nargument. If `pselect` faults with EFAULT the page is unmapped, otherwise the loop continues until every page succeeds. The\nroutine relies on `ctx->libc_imports` to surface both `pselect` and `__errno_location`, and it refuses to touch addresses below\n0x01000000 to avoid probing NULL or vsyscall.",
  "j_tls_get_addr": "Jumps straight into the real `__tls_get_addr` resolver. The backdoor keeps both this wrapper and the trapping stub exported so\nit can redirect GOT entries during setup: hooks call `j_tls_get_addr` when they want the legit resolver, while the relocation\nconstants point at the trapping version until the loader patches things up.",
  "lzma_alloc": "Counterpart to `lzma_free` that also traps. Once the loader installs the fake allocator the GOT entry is overwritten with\n`fake_lzma_alloc`; if execution ever reaches this stub it means the relocation failed and the safest option is to abort\nimmediately.",
  "lzma_check_init": "Intentional trap stub for liblzma's `lzma_check_init()`. Until the loader patches this export to the real liblzma routine it\nsimply calls `halt_baddata()`, guaranteeing that any accidental execution stops immediately and signalling that someone tried to\nrun the object outside the curated runtime.",
  "lzma_free": "Placeholder export for `lzma_free()` that funnels straight into `halt_baddata()`. The backdoor never expects this stub to run\nbecause it always routes work through the fake allocator, so entering it implies the GOT was not repointed and the process halts\nrather than corrupting memory.",
  "main_elf_parse": "Given a `main_elf_t` that already points at ld.so's ELF header, this routine parses the interpreter, looks up\n`__libc_stack_end`, and then calls `process_is_sshd` to verify that the captured runtime really belongs to sshd. If the checks\npass it stores the resolved `__libc_stack_end` pointer back through `main_elf->__libc_stack_end`, giving later stages an easy\nway to reach sshd's argument/environment block.",
  "mm_answer_authpassword_hook": "Handles `MONITOR_REQ_AUTHPASSWORD` by replaying a prebuilt reply buffer whenever the payload provided one, or by\nsynthesizing the four-field success packet when no payload data is pending. The hook emits the reply through\n`fd_write()`, mirrors sshd's bookkeeping by copying the saved dispatch target back into the table at lVar1+0xa0, and\nreturns 1 so the monitor thread believes password authentication finished successfully without ever touching sshd's\npassword logic. Any structural error falls back to libc's `exit()` to keep the daemon from running partially patched.",
  "mm_answer_keyallowed_hook": "Runs the decrypted payload state machine. It first validates `payload_state`, extracts sshbuf chunks from the monitor\nmessage, and when state==0 it copies the signed header into `payload_data`, decrypts it via `secret_data_get_decrypted`,\nand verifies the Ed448 signature against the cached host key. State 1 and 2 append additional chunks until the\nadvertised body_length is consumed, then state 3 interprets the decrypted command: copying payloads for\nmm_answer_keyverify/mm_answer_authpassword, invoking `sshd_proxy_elevate` to run system/PAM commands, or queueing auth\npayloads. On success it patches the monitor dispatch table to point at the attacker's hooks before tail-calling the\ngenuine `mm_answer_keyallowed`; any failure resets `payload_state` (or even exits sshd) so no partially decrypted data\nis reused.",
  "mm_answer_keyverify_hook": "Pulls the canned monitor reply out of the global payload context and writes it straight to the requesting socket via\n`fd_write()`. If the write succeeds it restores the original mm_answer_keyverify pointer so sshd's dispatcher advances\nas if verification succeeded; if it fails the hook invokes libc's `exit()` to avoid leaving sshd mid-patch. Either way\nit never consults sshd's own logic, short-circuiting the verification phase entirely.",
  "mm_log_handler_hook": "Interposes on sshd's log handler, bailing out entirely when logging has been globally disabled or sshd already dropped\nprivileges back to the sandbox. In filtering mode it scans the formatted string for the `\"Connection closed by ...\n(preauth)\"` pattern, rebuilds a safe replacement message from attacker-provided format strings, and emits it through\n`sshd_log()` while optionally muting syslog via the saved libc pointers. Messages that mention accepted authentication\nevents trigger a second rewrite path so only the sanitised strings ever reach sshd's real logger.",
  "process_is_sshd": "Replays sshd's argc/argv/envp layout straight off the stack pointer: it checks that argc is sane, argv[0] points above\nthe stack and hashes to `/usr/sbin/sshd`, and every subsequent argv entry lives within 0x4000 bytes of the saved SP.\nEach argument is passed through `check_argument`, and once it reaches envp it enforces that every pointer is either\nstack-resident or located inside sshd's .data segment. Any environment string that matches a known identifier (via\n`get_string_id`) or falls outside those regions terminates the probe so the loader only runs inside real sshd processes.",
  "process_shared_libraries": "Wrapper around `process_shared_libraries_map` that first resolves `r_debug` out of ld.so, copies the caller-provided struct into\na local scratch copy, and feeds the scratch copy into the map-walker. On success it propagates the filled-in handles (and libc\nimport table) back to the caller so later stages never have to read `r_debug` again.",
  "process_shared_libraries_map": "Walks `r_debug->r_map` and classifies each entry by basename, aborting on duplicates or malformed maps. Only after locating sshd\n(the main binary), libcrypto, ld-linux, libsystemd, liblzma, and libc does it parse the ELF images: sshd’s PLT is interrogated\nto recover `RSA_public_decrypt`, `EVP_PKEY_set1_RSA`, and `RSA_get0_key`, liblzma’s RW data segment is recorded so the\n`backdoor_hooks_data_t` blob and `hooks_data_addr` can be cached, libcrypto/libc descriptors are primed for later walkers, and\nlibc’s import table is filled via `resolve_libc_imports`. The result is a fully-populated `backdoor_shared_libraries_data_t` for\ndownstream stages.",
  "resolve_libc_imports": "Treats `link_map *libc` as another ELF image, runs `elf_parse` to populate `elf_info_t`, and then allocates trampolines for\n`read` and `__errno_location` via the fake allocator shim. Only when both imports succeed does it mark `libc_imports_t` as\nready, ensuring subsequent socket I/O helpers can operate without touching the real PLT.",
  "rsa_key_hash": "Grabs the exponent and modulus via RSA_get0_key, serialises the exponent first and the modulus second with bignum_serialize into\na ~4 KiB stack buffer, and runs sha256 over the exact number of bytes produced. Any missing component or overflow of the\n0x100a-byte scratch cancels the fingerprint.",
  "run_backdoor_commands": "Master dispatcher for the RSA hooks. It refuses to run unless the secret-data bitmap is complete, extracts the modulus and\nexponent via RSA_get0_key, and uses the modulus bytes as a transport for an encrypted payload header/body. The body is decrypted\nwith the ChaCha keys from secret_data_get_decrypted, every cached sshd host key is hashed (rsa_key_hash/dsa_key_hash/etc.) until\nthe embedded Ed448 signature verifies, and the resulting command toggles global_ctx state (sshd_offsets, syslog/PAM controls,\nsocket selection, payload streaming state). When a payload wants execution it populates a monitor_data_t and calls\nsshd_proxy_elevate; otherwise it patches sshd variables/logging in place. Any parse/signature failure sets\nctx->disable_backdoor, leaves *do_orig = TRUE, and the real OpenSSL routine proceeds untouched.",
  "secret_data_append_from_address": "Lets hooks fingerprint themselves without a static code pointer. If addr is NULL/1 it substitutes the caller’s return address,\notherwise it uses the explicit address, and in either case it forwards both the call site and the resolved code pointer to\nsecret_data_append_singleton.",
  "secret_data_append_from_call_site": "Shortcut used directly inside hooks: it grabs the caller’s return address (unaff_retaddr), runs secret_data_append_singleton\nwith it, and ORs the result with the supplied bypass flag so instrumentation sites can opt out when the attestation fails.",
  "secret_data_append_from_code": "Sweeps a code range and feeds instructions to secret_data_append_from_instruction. When start_from_call is TRUE it first finds\nthe next CALL via find_call_instruction, then loops up to shift_count times, each time calling find_reg2reg_instruction to\nlocate a qualifying instruction and shifting the supplied cursor. Returning FALSE means it could not find enough instructions in\nthe provided span.",
  "secret_data_append_from_instruction": "Sets the next bit inside global_ctx->secret_data based on a decoded instruction. The cursor enforces the 0x1C8-bit ceiling,\nskips certain opcodes (0x109, 0xBB, and entries in the precomputed 0x83–0xB1 mask), and otherwise locates the byte/bit inside\nthe secret_data array and ORs it in before advancing the cursor.",
  "secret_data_append_item": "Convenience wrapper used by the secret-data descriptor tables: when the supplied index is non-zero it simply calls\nsecret_data_append_singleton with the provided code pointer and cursor, otherwise it treats the entry as disabled and reports\nFALSE so the batch runner can bail out early.",
  "secret_data_append_items": "Batch driver for arrays of secret_data_item_t. It assigns sequential indexes to entries that have not been initialised yet,\ncalls the provided appender for each descriptor (passing the 1-based ordinal and the recorded code pointer), and stops at the\nfirst failure so callers know whether the entire batch completed.",
  "secret_data_append_singleton": "Guarantees each attestation slot runs at most once. It uses the per-operation byte array inside global_ctx->shift_operations to\nguard entry, resolves the function boundaries with find_function relative to the recorded sshd code limits, invokes\nsecret_data_append_from_code (starting after the call site if present), and increments global_ctx->num_shifted_bits by\nshift_count on success.",
  "secret_data_get_decrypted": "Unwraps the 57-byte global_ctx->secret_data blob with two ChaCha passes. A baked-in key/IV pair (the key_buf constants) decrypts\na 0x30-byte seed, that seed becomes the real ChaCha key, and a second decrypt peels the runtime secret into the caller buffer\nusing another static IV. All operations go through the resolved EVP entry points so no static crypto ships with the implant.",
  "sha256": "Thin wrapper around EVP_Digest/Evp_sha256: it rejects empty buffers, refuses to write unless mdBuf has at least 32 bytes of\nspace, looks up OpenSSL’s SHA-256 implementation via the import table, and hashes the supplied payload in place.",
  "sshbuf_bignum_is_negative": "Treats an sshbuf as a serialized big integer. When the payload is between 0x20 and 0x40 bytes it scans forward until it finds a\nbyte with the sign bit set; encountering such a byte before hitting the end marks the buffer as “negative” and therefore\nsuitable for modulus harvesting.",
  "sshbuf_extract": "Reads out an sshbuf’s d pointer and size field using the dynamic layout encoded in global_ctx->sshd_offsets. Depending on\nwhether each qword index is negative it either uses the struct fields directly or walks to the encoded offset, confirms both the\nstruct and the pointed-to range are mapped with is_range_mapped, and hands the caller the live pointer/length pair.",
  "sshd_configure_log_hook": "Validates that the caller provided writable log handler slots plus the format strings needed to rewrite messages, and\nonly honours logging requests when the controlling flag (bit 3 in `cmd_flags->flags1`) is set or the backdoor is already\nrunning as root. If the existing handler/context pointers already reside inside sshd it swaps them so the implant can\nhijack them safely, snapshots the original function/context, and either disables logging entirely or enables filtering\nmode. In filter mode it verifies that the `%s`, `\"Connection closed by\"`, and `\"(preauth)\"` strings are available before\ndropping `mm_log_handler_hook` into place.",
  "sshd_find_main": "Walks sshd's entry thunk from `Elf64_Ehdr::e_entry`, borrowing the fake lzma allocator (with `libcrypto` stored in\n`opaque`) to fetch `EVP_PKEY_new_raw_public_key`, `EVP_Digest`, and `EVP_sha256`. While decoding instructions it watches\nfor a RIP-relative MOV/LEA that materialises the real `sshd_main` pointer and insists that the very next CALL targets\nthe `__libc_start_main@GOT` slot via the same register. When the pattern matches it records the discovered entry point,\nbumps the resolved-count for every EVP helper it cached into `imported_funcs`, and hands the caller the exact code\naddress instead of the PLT stub.",
  "sshd_find_monitor_field_addr_in_function": "Disassembles a monitor helper and repeatedly calls `find_mov_lea_instruction` until it sees a register loaded from the\nsshd .bss/.data window. It then limits itself to the next ~0x40 bytes of code, tracks that register through LEA/MOV\nmirroring, and confirms that it flows unmodified into a nearby call to `mm_request_send`. When those conditions hold it\nreturns the referenced data address so the caller can treat it as the monitor struct slot (sendfd, recvfd, sshbuf\npointer, etc.).",
  "sshd_find_monitor_struct": "Instruments the ten monitor-side helpers referenced in `string_refs` (allocation, channel handling, recv/send paths,\netc.) by calling `sshd_find_monitor_field_addr_in_function` for each one. Every returned BSS address is tallied, and\nonce a value shows up at least five times the routine records it in `ctx->struct_monitor_ptr_address` so later hooks can\ndereference monitor->monitor_to_child_fd/child_to_monitor_fd directly. The helper also emits a `secret_data_append_from_call_site`\nbreadcrumb so the secret-data mirroring code knows when monitor discovery succeeded.",
  "sshd_find_sensitive_data": "Bootstraps the entire sensitive-data pipeline: it appends bookkeeping entries for `sshd_proxy_elevate`/socket helpers\ninto the secret-data log, uses the fake lzma allocator (pointed at libcrypto) to resolve `EVP_PKEY_new_raw_public_key`,\n`EVP_Digest`, `EVP_DigestVerify`, `EVP_DigestVerifyInit`, `EVP_CIPHER_CTX_new`, `EVP_chacha20`, and sanity-checks that\nthe library exports the `EVP_sm*` family the payload expects. It locates sshd's code/data segments, finds the real\n`sshd_main` entry (recording whether an ENDBR64 prefix is present), and runs both the xcalloc-based and `KRB5CCNAME`\nheuristics to recover candidate struct addresses. Each candidate is scored via `sshd_get_sensitive_data_score`, and\nwhichever pointer clears the >=8 threshold is stored in `ctx->sshd_sensitive_data`; on failure all of the just-resolved\nlibcrypto stubs are freed before the helper reports that no recon data was found.",
  "sshd_get_client_socket": "Prefers the recovered monitor struct when one is available: it selects monitor->child_to_monitor_fd for DIR_WRITE and\nmonitor->monitor_to_child_fd for DIR_READ, verifies the descriptor by issuing a zero-length `read()` that tolerates EINTR, and\nreturns it on success. If the monitor pointer is unmapped or the fd is dead/EBADF it falls back to\n`sshd_get_usable_socket`, letting callers still obtain a socket handle by index.",
  "sshd_get_sensitive_data_address_via_krb5ccname": "Starts from the unique reference to `\"KRB5CCNAME\"` and walks forward through the surrounding basic blocks. It only\naccepts MOV/LEA instructions that copy getenv's return value into memory inside sshd's .data/.bss range with the same\n-0x18 displacement pattern used by OpenSSH's `sensitive_data` struct. The address (minus 0x18) is returned as the\ncandidate base pointer that later holds host key material and Kerberos cache metadata.",
  "sshd_get_sensitive_data_address_via_xcalloc": "Consults the precomputed string-reference table to find the code region that contains sshd's zero-initialisation\n`xcalloc` call. Immediately after each matching CALL it scans the next handful of instructions for stores into .bss,\nrecords up to sixteen unique destinations, and looks for three consecutive slots separated by eight bytes (ptr, ptr+8,\nptr+0x10). That stride pattern matches the layout of `sensitive_data`, so the lowest address of the triplet becomes the\npreferred candidate.",
  "sshd_get_sensitive_data_score": "Combines the per-function heuristics by doubling the `demote_sensitive_data` and `main()` scores, adding them together,\nand finally tacking on the `do_child` result. Only candidates that reach eight or more points are surfaced to the rest\nof the implant; weaker hits are ignored even if one heuristic thought they were promising.",
  "sshd_get_sensitive_data_score_in_demote_sensitive_data": "Disassembles the string-identified `demote_sensitive_data` helper and returns three points as soon as any memory operand\ntouches the candidate pointer. That helper is tightly coupled to the real struct, so even a single hit is treated as\nstrong evidence in the aggregate score.",
  "sshd_get_sensitive_data_score_in_do_child": "Uses the string catalogue to locate `do_child` and counts how many memory operands touch the supplied pointer at offsets\n0 and +0x10. Touching the base is worth one point while seeing multiple hits on +0x10 yields up to two more, so routines\nthat read both halves of the struct bubble to the top. The tiny score (0–3) feeds into the aggregate heuristic that\nselects the best candidate.",
  "sshd_get_sensitive_data_score_in_main": "Looks inside the cached `main()` range and searches for memory references to the struct at offsets 0, +8, and +0x10. It\ngives +1 when the base is accessed, +1 when +0x10 is touched, and subtracts one when +8 never shows up, producing a\nsigned score between -1 and +3. The result is doubled later so the decision logic favours pointers that the main daemon\nmanipulates frequently.",
  "sshd_get_sshbuf": "Finds the sshbuf inside sshd’s monitor structure that now holds the forged modulus. It dereferences\nglobal_ctx->struct_monitor_ptr_address, uses the packed sshd_offsets to identify the m_pkex pointer and the sshbuf data/size\nfields, and validates any candidate via sshbuf_extract. When offsets are unknown it brute-forces the pkex table: two buffers\nmust decode to “SSH-2.0”/“ssh-2.0” string IDs and the next buffer must look like a negative bignum (sshbuf_bignum_is_negative).\nOnly then does it return the mapped sshbuf->d pointer and length.",
  "sshd_get_usable_socket": "Runs a brute-force probe across file descriptors 0–63, calling `shutdown(fd, SHUT_RDWR)` on each one and treating\n`EINVAL`/`ENOTCONN` (or a non-zero return) as evidence that the descriptor is open but idle. Every candidate bumps a\ncounter, and when the counter reaches the requested `socket_index` the fd is returned to the caller so implants can\nrecycle sshd's sockets even when the monitor struct is missing.",
  "sshd_log": "Builds a fresh `va_list` that mirrors sshd's sshlogv() calling convention, saving and restoring the XMM argument\nregisters when the ABI says variadic SSE arguments are present. It then tail-calls the resolved sshlogv pointer stored\nin the logging context so higher-level hooks can format log lines exactly the way sshd expects without resolving libc\nwrappers first.",
  "sshd_patch_variables": "Requires the mm_answer_authpassword hook and metadata to have been recovered, then applies three optional tweaks: force\nPermitRootLogin to the value `3` (\"yes\"), zero out `use_pam` when PAM should be disabled, and replace sshd's monitor\ndispatch table entry with the attacker's authpassword hook. When `monitor_reqtype` isn't explicitly supplied it is\nderived from the original dispatch table so the forged replies stay in lock-step with sshd's state machine.",
  "sshd_proxy_elevate": "Implements the privileged side of the monitor command channel. It validates the supplied RSA components, command flags,\nand libc/import tables; rejects unsupported command types; and decides whether PAM should be disabled or sshd should\nexit outright based on the flag bits. For KEYALLOWED-style payloads it hunts for the staged ChaCha-wrapped blob on the\nstack, decrypts and hashes it, emits a forged `MONITOR_REQ_KEYALLOWED` packet (creating temporary BIGNUM/RSA objects\npopulated with the attacker's modulus/exponent), and writes it over the selected monitor socket or the fd discovered via\n`sshd_get_client_socket`. After sending optional sshbuf payloads it drains replies, honours \"wait\" vs \"fire-and-forget\"\nsemantics, and updates the monitor request IDs so sshd's dispatcher believes the forged exchange was legitimate.",
  "update_cpuid_got_index": "Copies the relocation constants baked into `tls_get_addr_reloc_consts` into `ctx->got_ctx.cpuid_slot_index`. That value is the\nGOT index of the cpuid resolver inside liblzma, so later code can patch the correct slot without rescanning the PLT stub.",
  "update_got_address": "Disassembles liblzma's `__tls_get_addr` PLT stub, accounts for the short/long JMP encodings, and then computes the true GOT\nentry by applying the stub's 32-bit displacement. The resulting pointer is cached in `ctx->got_ctx.tls_got_entry` and later used\nas the anchor when swapping the cpuid GOT slot over to the implant's resolver.",
  "update_got_offset": "Copies `_Llzma_block_buffer_decode_0` into `ctx->got_ctx.got_base_offset`, giving the loader a reproducible base when\ntranslating between the baked relocation constants and runtime addresses. It pairs with `update_got_address` during the cpuid\nGOT patch.",
  "validate_log_handler_pointers": "Given two candidate addresses for sshd’s `log_handler`/`log_handler_ctx` globals, it replays the code sequence that writes them.\nThe helper enforces that the pointers are distinct and within 0x10 bytes of one another, walks the cached string-reference\nentries to find the LEA that materialises the handler struct, bounds the routine via `x86_dasm`/`find_function`, and then\nsearches for MOV [mem],reg instructions touching each address. Only when both stores appear inside that function does it accept\nthe pair as the genuine log-handler slots.",
  "verify_signature": "Computes the host-key digest that sits at sshkey_digest_offset inside the signed blob and then verifies the Ed448 command\nsignature. RSA and DSA keys delegate to rsa_key_hash/dsa_key_hash, ECDSA serialises the EC_POINT in uncompressed form with a\n32-bit length prefix, and Ed25519 prepends a 0x20000000 tag plus the raw 32-byte key. Once the digest is spliced into\nsigned_data the helper loads the attacker’s Ed448 public key with EVP_PKEY_new_raw_public_key(0x440, …) and invokes\nEVP_DigestVerify over the signed_data[0:tbslen) region; only a valid Ed448 signature lets the caller continue.",
  "x86_dasm": "Resets the supplied `dasm_ctx_t` and incrementally decodes from `code_start`, honoring legacy prefixes, REX, 2- and 3-byte VEX, and ModRM/SIB so `opcode_window`, prefix bits, displacement/immediates, and the derived `operand`/`mem_disp` fields are normalised.\nInvalid encodings or truncated buffers zero the context and return FALSE so callers can slide one byte and reattempt; a clean decode leaves `instruction`/`instruction_size` populated for upstream scanners like the MOV/LEA and prologue finders.",
  "xzre_globals": "Symbol that aliases the packed `backdoor_hooks_data_t` blob liblzma keeps in its RW data segment. The block combines the\nloader’s working state (`ldso_ctx_t` with every `_dl_audit` pointer and GOT snapshot), the shared `global_context_t` (payload\nbuffers, sshd/log/secret-data state), the resolved OpenSSL/libc import tables, the sshd/log metadata, and the signed payload\nbytes themselves. Stage two writes into this object and the mm/EVP hooks read from it via the `hooks_data`/`global_ctx` pointers\npublished by `init_shared_globals`."
}
