{
  "backdoor_entry": "Executes inside liblzma's IFUNC resolver, counting invocations and calling `backdoor_init` on the second pass. This turns the seemingly harmless cpuid resolver into the backdoor's bootstrap path.",
  "backdoor_init": "Initialises the IFUNC entry context, locates the cpuid GOT slot, and swaps it to point at `backdoor_init_stage2`. From here the loader can patch ld.so and install the audit-based hooks without leaving the resolver frame.",
  "backdoor_init_stage2": "Executes inside the hijacked cpuid resolver, initialises shared globals and hook contexts, and loops until they're ready; once prepared it jumps into `backdoor_setup` and then restores the cpuid context. If setup fails, it still harvests cpuid data so the resolver can fall back cleanly.",
  "backdoor_setup": "Performs the full installation workflow: gathers link_map handles, initialises shared globals, resolves libc/libcrypto imports, rewires ld.so's audit structures, updates GOT/PLT entries, and seeds secret-data tracking. On success it leaves `backdoor_symbind64` registered so every sshd→libcrypto call is mediated by the backdoor.",
  "bignum_serialize": "Writes a BIGNUM into a length-prefixed buffer, dropping redundant leading zeros so later hashes are stable. Key-fingerprinting helpers call it before running SHA256 over RSA or DSA parameters.",
  "c_memmove": "Private implementation of `memmove` so the object never has to import libc for something this trivial. It detects backwards overlap (`src < dest < src+cnt`) and copies from the end towards the beginning in that case; every other scenario devolves into a forward copy loop. Either way the original `dest` pointer is returned so callers can chain copies just like they would with the libc version.",
  "c_strlen": "Minimal strlen implementation that the loader can call before libc is safe to use. It shows up when scanning sshd buffers for protocol markers during the backdoor's environment checks.",
  "c_strnlen": "Bounded strlen helper used to cap string walks inside untrusted buffers. The backdoor leans on it while parsing ssh login structures so a malformed packet cannot drive the length probes out of bounds.",
  "chacha_decrypt": "Thin wrapper around OpenSSL's ChaCha20 decrypt primitives that operates through the resolved imports table. The backdoor uses it both to unwrap its embedded secrets and to decrypt attacker payloads after they arrive via the monitor channel.",
  "check_argument": "Scans a dash-prefixed argv string for forbidden switches like '-d'/'-D' or unusual characters and returns a pointer only when a disallowed flag is present. `process_is_sshd` relies on it to detect debug or non-daemon modes so the implant can stand down in those cases.",
  "check_backdoor_state": "Sanity-checks the payload buffer and state machine before processing more command data, resetting the state on any inconsistency. The loader calls it before and after decryptions to avoid reusing corrupted payloads.",
  "contains_null_pointers": "Scans a pointer array for NULL entries. The crypto helpers call it to ensure every required OpenSSL import was resolved before attempting decrypt or verify operations.",
  "count_bits": "Classic popcount loop that returns the number of set bits in a 64-bit value. The string-id trie and several instruction filters rely on it when they compress lookup tables for pattern matching.",
  "count_pointers": "Uses malloc_usable_size to count populated pointer slots in a heap block without knowing the allocation size. Secret-data heuristics use it when walking monitor tables extracted from sshd memory.",
  "_cpuid_gcc": "AutoDoc: Generated from reverse engineering.\n\nSummary:\n  GCC-style CPUID helper that dispatches to the appropriate intrinsic wrapper for the requested leaf before returning EAX/EBX/ECX/EDX as separate pointers.\n\nNotes:\n  - Mirrors libgcc's cpuid shim, covering base, extended, and cache-topology leaves with dedicated helpers.\n  - Falls back to the raw __builtin_cpu_supports() thunk when a leaf is not special-cased.",
  "decrypt_payload_message": "Decrypts an incoming key_payload_t chunk with the recovered ChaCha key, appends it to the staged buffer, and advances the payload state machine. This is how multi-part attacker commands are reassembled before verification.",
  "dsa_key_hash": "Serialises the DSA public parameters and computes a SHA-256 digest using the resolved libcrypto helpers. The monitor hooks use that fingerprint to recognise host keys referenced by attacker commands without leaking the private material.",
  "elf_contains_vaddr": "Thin wrapper around `elf_contains_vaddr_impl` that keeps the public API surface simple. Every range-checker in the loader funnels through it so the flag handling, recursion guard, and alignment fixes stay centralized, making it easy to detect when a pointer falls outside the parsed ELF image.",
  "elf_contains_vaddr_impl": "Validates that `[vaddr, vaddr + size)` is entirely covered by one or more PT_LOAD segments whose `p_flags` mask includes the requested bits. The helper page-aligns both ends of the interval, walks every loadable program header, and recurses when the range straddles multiple segments so partial overlaps are rechecked piecemeal.\n\nIt refuses to run more than 0x3ea iterations (preventing runaway recursion), insists that the candidate addresses live inside the mapped ELF image, and short-circuits to TRUE when `size` is zero. Callers pass `p_flags` values such as PF_X or PF_W to differentiate text, data, and RELRO spans.",
  "elf_contains_vaddr_relro": "Combines `elf_contains_vaddr` with the GNU_RELRO metadata harvested during `elf_parse`. The range must sit inside a read-only PT_LOAD (PF_R), and the module must have advertised a RELRO segment; if so the helper also verifies that `[vaddr, vaddr+size)` falls within the page-aligned RELRO window cached in `elf_info_t`. Anything outside that protected span returns FALSE, which prevents the loader from treating writable data as RELRO by mistake.",
  "elf_find_function_pointer": "Takes a string-reference catalogue entry, locates the associated RELRO slot, and checks CET landing requirements before returning the pointer. The loader relies on it to identify sshd callback tables—such as monitor handlers—that it will later overwrite with backdoor functions.",
  "elf_find_rela_reloc": "Searches the RELA relocation array for an entry tied to a given code pointer. When `encoded_string_id` is non-zero it is treated as an absolute address inside the module: the helper subtracts `elfbase` to match against `r_addend` and, on success, returns the relocated slot at `r_offset`. When the argument is zero the caller instead wants the raw addend pointer, so the helper immediately returns `elfbase + r_addend`.\n\nA pair of optional range bounds and a resumption index can be supplied in the additional SysV argument registers; if present they force the returned address to fall inside `[low, high]` and let the caller continue scanning from the previous index. Failing to find a match (or discovering that the module never exposed RELA relocations) yields NULL and, if a cursor pointer was provided, stores the position it stopped at.",
  "elf_find_relr_reloc": "Performs the same search as `elf_find_rela_reloc` but against the packed RELR format. It replays the RELR decoding algorithm (literal entry vs bitmap entry), sanity-checks each decoded pointer with `elf_contains_vaddr`, compares the pointed-to value against the requested target address, and optionally enforces a lower/upper bound plus an iteration cursor via the extra argument registers. Returning NULL means there were no RELR records, the address never appeared in the run, or one of the decoded pointers failed validation.",
  "elf_find_string": "Iterates through the cached `.rodata` window, calling `get_string_id` on each byte offset until it encounters a recognizable encoded string. If `*stringId_inOut` is zero the first discovered string wins and its id is written back; otherwise the search continues until an exact id match is found. The optional `rodata_start_ptr` lets callers resume from a previous location or constrain the search to a suffix of the segment.",
  "elf_find_string_reference": "Finds the first instruction that references a specific string literal between the supplied code bounds. The loader uses this pinpoint search to anchor subsequent pattern matching when triangulating hook targets from log messages and status strings.",
  "elf_find_string_references": "Indexes interesting .rodata strings and the instructions that reference them, recording surrounding function bounds for later lookups. Many downstream heuristics consume this table to locate sshd routines and global pointers tied to sensitive behaviour.",
  "elf_get_code_segment": "Finds and caches the first executable PT_LOAD segment. The routine walks the program headers until it sees a segment with PF_X set, computes the runtime address by subtracting the ELF's minimum virtual address from `p_vaddr`, page-aligns both ends, stores the start/size inside `elf_info_t`, and returns the aligned base while writing the computed size through `pSize`. Subsequent calls use the cached values to avoid rescanning the headers.",
  "elf_get_data_segment": "Walks every PT_LOAD segment looking for the last read/write mapping (PF_W|PF_R). Once found it caches three pieces of information: the base of the mapped data (`data_segment_start`), the amount of padding between the end of the file-backed bytes and the next page boundary (`data_segment_alignment`), and the total size of the aligned segment. Callers either request the true segment span (`get_alignment == FALSE`) or the padding region (when TRUE), which is where the implant later tucks the `backdoor_hooks_data_t` structure.",
  "elf_get_got_symbol": "Identical pattern but aimed at the main RELA table: it requires `flags & 2` (meaning RELA records were found) and then calls `elf_get_reloc_symbol` with relocation type 6 (R_X86_64_GLOB_DAT). Successful lookups hand back the writable GOT slot for the symbol so the loader can redirect it; failure means the symbol was not imported through a GOT relocation.",
  "elf_get_plt_symbol": "Looks up the PLT thunk for a given symbol by delegating to `elf_get_reloc_symbol` with relocation type 7 (R_X86_64_JUMP_SLOT). It first makes sure the module actually advertised a PLT relocation table (flag bit 1) and caches its size, then returns the GOT/PLT entry that will be overwritten during hook installation. NULL means either the relocation table was absent or the requested symbol never appeared there.",
  "elf_get_reloc_symbol": "Generic helper that scans an arbitrary relocation array for undefined symbols of a specific relocation type (e.g., GOT vs PLT) and a specific encoded name. It iterates through `num_relocs`, ensures the relocation type matches `reloc_type`, confirms the associated symbol is really an import (`st_shndx == 0`), and then resolves the symbol name via `get_string_id` before comparing it to `encoded_string_id`. When it finds a match it returns the relocated address (`elfbase + r_offset`) so the caller can patch GOT/PLT entries in place.",
  "elf_get_rodata_segment": "Locates the first read-only PT_LOAD segment that lives entirely after the executable code. It first asks `elf_get_code_segment` for the text range so it can ignore overlapping pages, then scans for PF_R-only segments, page-aligns their bounds, and picks the lowest segment whose start is beyond the end of `.text`. The result is cached in `elf_info_t` and handed to callers alongside its size so later routines (string searches, RELRO probes) can reuse the computed window.",
  "elf_parse": "Initialises an `elf_info_t` from an in-memory ELF header: zeroes every field, records the lowest PT_LOAD virtual address, locates the PT_DYNAMIC segment, and caches pointers to the strtab, symtab, relocation tables (PLT, RELA, RELR), GNU hash buckets, version records, and GNU_RELRO metadata. Each pointer retrieved from the dynamic table is validated with `elf_contains_vaddr` so forged headers are rejected.\n\nIt also enforces invariants such as 'only one PT_GNU_RELRO segment', derives the number of dynamic entries, and flips feature bits (`flags`) so later helpers know whether RELR, versym, or gnurelro data is present. Failure to locate the dynamic segment, find the required headers, or keep derived pointers inside mapped memory causes the parse to abort with FALSE.",
  "elf_symbol_get": "Symbol resolver that trusts the GNU hash table the loader extracted earlier. After setting a telemetry bit it walks each hash bucket, validates the bucket and chain addresses, and replays the classic GNU hash lookup to pull `Elf64_Sym` entries out of `.dynsym`. When a candidate symbol has a non-zero value and section index, the helper hashes the associated string with `get_string_id` and compares it against the requested encoded id.\n\nIf a symbol version is supplied it additionally consults `.gnu.version`/`.gnu.version_d`: the version index is read from `versym`, then matched against the verifier definitions by walking the linked `verdef` list and comparing the underlying string id. Returning NULL means either the target symbol is missing, the module did not advertise GNU hash+version tables, or the string/relocation pointers failed validation.",
  "elf_symbol_get_addr": "Convenience layer on top of `elf_symbol_get`: look up the symbol, make sure it is defined (both `st_value` and `st_shndx` are non-zero), and then turn the symbol value into a process address by adding it to `elf_info->elfbase`. Returning NULL indicates either the symbol does not exist or it represents an import/resolver stub that lacks a concrete address.",
  "extract_payload_message": "Parses an sshbuf blob to locate the RSA modulus portion, updating the buffer pointer and reporting its length. The command decoder uses it to peel the attacker payload out of host-key certificates carried over the monitor channel.",
  "fake_lzma_alloc": "Companion to `fake_lzma_free` that turns the liblzma allocation API into a symbol resolver. The `opaque` parameter is treated as an `elf_info_t *`, the requested `size` is reinterpreted as an `EncodedStringId`, and it simply returns whatever `elf_symbol_get_addr()` produces. The `nmemb` argument is ignored because the helper is never asked to allocate real memory—it only masquerades as an allocator long enough to bootstrap symbol lookups inside ld.so.",
  "fake_lzma_free": "No-op placeholder that exists solely to satisfy the liblzma allocator interface the implant exposes. The loader wires this stub into `lzma_allocator.free` until it can swap in the genuine host callbacks, so any invocation is guaranteed to do nothing other than prove that the fake allocator is still active.\n\nHaving an inert body keeps the import surface small while still exporting a correctly typed symbol, and it gives the runtime a reliable indicator that a caller incorrectly tried to free memory through the bootstrap allocator.",
  "fd_read": "Wrapper around libc's read that retries on EINTR and honours the resolver-provided imports table. All socket reads during monitor spoofing go through it so the implant never depends on glibc symbols directly.",
  "fd_write": "Companion wrapper for write with EINTR handling. It powers every forged monitor message the backdoor emits while replaying commands or proxying authentication traffic.",
  "find_add_instruction_with_mem_operand": "Locates ADD instructions that update memory at a given address, capturing the scale of the increment. The scoring logic uses it to observe how sshd mutates counters so the implant can tag sensitive buffers.",
  "find_addr_referenced_in_mov_instruction": "Scans a referenced function for MOV instructions that materialise an address inside the supplied data window. The backdoor uses it to recover struct-field pointers (for example the monitor sockets) so it can redirect them to its own handlers.",
  "find_call_instruction": "Disassembles forward until it encounters a CALL opcode and reports both the instruction and target. The hook finder uses it to locate indirect dispatcher sites in sshd so the injected shims can be spliced in safely.",
  "find_dl_audit_offsets": "Orchestrates the discovery of `l_name`, `_dl_naudit`, `_dl_audit`, and `l_audit_any_plt` offsets, resolving extra libcrypto helpers along the way. `backdoor_setup` relies on the resulting hooks context to rewire ld.so's audit plumbing to its own symbind handler.",
  "find_dl_naudit": "Matches the `_dl_naudit` and `_dl_audit` references inside ld.so, records their offsets within `__rtld_global_ro`, and resolves a few extra crypto routines. Those offsets let the implant point ld.so's global audit state at its forged interface.",
  "find_function": "Combines the prologue scan with a forward sweep to determine both the start and end addresses of a function. Backdoor initialization relies on it when it needs exact bounds for copying original bytes or scheduling follow-up pattern searches.",
  "find_function_prologue": "Sweeps backward from a code pointer looking for a plausible function prologue based on decoded instruction patterns. The runtime loader uses it to recover entry points in stripped sshd/libc images before installing hooks.",
  "find_instruction_with_mem_operand": "Convenience wrapper that searches for MOV/LEA forms touching a specific address and reports the displacement. It feeds higher-level routines that locate struct fields for the backdoor's runtime patch table.",
  "find_instruction_with_mem_operand_ex": "Performs a generic sweep for any instruction that touches memory, applying a caller-supplied predicate to filter the operands. The loader routes specialised searches through it when reconstructing complex data flows in sshd.",
  "find_lea_instruction": "Finds the next LEA instruction in the stream and returns operand details. The backdoor uses this to recover base-plus-offset calculations that point at data structures it later siphons.",
  "find_lea_instruction_with_mem_operand": "Restricts the LEA search to instructions that materialize a specific memory address, including displacement checks. It is invoked when the implant needs to confirm the exact offset of sshd globals before patching them.",
  "find_link_map_l_audit_any_plt": "Locates the offset of `l_audit_any_plt` inside `struct link_map` and then invokes the bitmask helper to learn how to toggle it. Together they arm the backdoor with everything needed to mark target modules as audited.",
  "find_link_map_l_audit_any_plt_bitmask": "Disassembles `_dl_audit_symbind_alt` to recover the load/test sequence for `link_map::l_audit_any_plt`, yielding both the flag address and the bitmask ld.so uses. The loader stores those values so it can flip the flag for sshd and libcrypto when masquerading as an audit module.",
  "find_link_map_l_name": "Walks ld.so's link_map records to locate the `l_name` string slot, verifies the offsets inside `_dl_audit_*`, and resolves several libc/libcrypto helpers. The backdoor needs that offset to rewrite libcrypto's link_map so the audit machinery accepts its injected interface.",
  "find_mov_instruction": "Searches for MOV instructions with configurable load/store semantics and hands back the matched operands. It underpins many of the signature searches the implant runs while deriving addresses for secret data or resolver trampolines.",
  "find_mov_lea_instruction": "Iterates through MOV and LEA instructions that move pointers into registers, honouring load/store direction flags. The loader uses it to chase GOT writes and frame setups when it has to recover sensitive pointers for the backdoor context.",
  "find_reg2reg_instruction": "Searches a code range for register-to-register moves while enforcing CET-safe constraints. The implant uses it when it needs to follow pointer copies without touching memory operands during its pattern hunts.",
  "find_string_reference": "Scans for instructions that reference a given string literal via RIP-relative addressing and records the instruction span. Secret-data hunters use it to line up code blocks that print or parse target strings so hooks can score them.",
  "_get_cpuid_modified": "AutoDoc: Generated from reverse engineering.\n\nSummary:\n  Patched _get_cpuid implementation that routes the first resolver invocation through backdoor_entry() and only issues CPUID when the advertised maximum leaf covers the requested value.\n\nNotes:\n  - Uses backdoor_entry() to install stage-two payloads while the IFUNC resolver is running.\n  - Returns 0 when the resolved CPUID limit is lower than the requested leaf, preserving glibc's contract.",
  "get_elf_functions_address": "Same pattern for the `elf_functions_t` dispatch table: start from the relocation-safe sentinel (`elf_functions_offset` lives near `fake_lzma_allocator_offset` in `.data`) and advance 12 struct slots to arrive at the live table. The convoluted pointer math lets the object carry offsets instead of absolute addresses, which keeps the relocation surface tiny while still giving the loader a stable way to reach its helper vtable.",
  "get_lzma_allocator": "Returns the `lzma_allocator` sub-structure embedded inside the fake allocator blob. Callers use it when they need to hand liblzma-style callbacks to another routine (e.g., passing an allocator into a liblzma API) while still pointing `opaque` at the implant's `elf_info_t`.",
  "get_lzma_allocator_address": "Manual pointer arithmetic that recovers the runtime address of the fake `fake_lzma_allocator_t` blob without requiring relocatable absolute addresses. The compiler emits a sentinel (`fake_lzma_allocator`) followed by padding, so this helper starts at that symbol and steps through the struct 12 times, effectively adding the baked-in 0x160-byte offset that lands on the real allocator instance the loader populated at build time.",
  "get_string_id": "Traverses the embedded string-trie and returns the encoded identifier for a runtime string. Every heuristic that matches sshd literals—logging, monitor messages, protocol banners—goes through this to avoid shipping plaintext strings in the payload.",
  "get_tls_get_addr_random_symbol_got_offset": "Seeds the entry context's GOT base and offset with the relocation constants tied to the canned `__tls_get_addr` symbol. Later code uses those values as the starting point when walking the PLT stub to discover the true GOT entry.",
  "hook_EVP_PKEY_set1_RSA": "Observes when sshd wraps an RSA key in an EVP_PKEY, hands the key to `run_backdoor_commands`, and then falls through to the true OpenSSL routine. It guarantees the backdoor sees host keys even if the decrypt hook never fires.",
  "hook_RSA_get0_key": "Lets the backdoor inspect an RSA key whenever sshd queries it by calling `run_backdoor_commands` first, then invoking the genuine RSA_get0_key. The original behaviour is preserved, but the implant captures the key material for later use.",
  "hook_RSA_public_decrypt": "Replaces `RSA_public_decrypt` with a wrapper that feeds the RSA handle and ciphertext into `run_backdoor_commands` before deciding whether to call the real function. Once the audit symbind hook is active, this is the primary trigger that lets attacker payloads run.",
  "init_elf_entry_ctx": "Seeds an `elf_entry_ctx_t` prior to running the IFUNC resolvers. It records the address of `cpuid_random_symbol`, captures the caller's return address from the saved frame (slot 3), recomputes the GOT offset via `update_got_offset`, primes the cpuid GOT index with `update_cpuid_got_index`, and clears the cached `got_ptr` so the resolver will refill it. The context is later consumed by the GOT patching code that splices the malicious cpuid stub into sshd.",
  "init_hooks_ctx": "Initialises the backdoor_hooks_ctx structure with pointers to the implant's hook stubs and shared data slots. backdoor_init_stage2 invokes it as a readiness check and interprets the 0x65 return value as \"shared globals not wired yet\" so setup can retry safely.",
  "init_imported_funcs": "Verifies the resolved-imports counter and ensures the three critical libcrypto PLT pointers are available, dropping in loader callbacks when they are not. The backdoor uses this guard before enabling the RSA hooks so it never intercepts calls without knowing how to fall back to the genuine routines.",
  "init_ldso_ctx": "Restores saved ld.so bookkeeping values (audit flags, _dl_audit pointers, naudit count) back to their pre-hook state. The loader calls it whenever hook setup fails so the dynamic linker is left consistent before sshd resumes execution.",
  "init_shared_globals": "Seeds the shared global structure with the high-level hook entry points and the address of the global_context_t singleton. Stage two populates it once so every hook (mm_answer_* and EVP glue) can resolve the same state block without further lookups.",
  "is_endbr64_instruction": "Checks whether the bytes at the current cursor encode an ENDBR64 landing pad, including the CET prefix variations. The pattern scanners call it so the backdoor can safely step past CET trampolines while carving prologues to patch.",
  "is_gnu_relro": "Obfuscated equality test for PT_GNU_RELRO. Instead of comparing `p_type` directly against `0x6474e552`, the code adds the caller supplied `addend` (always `0xa0000000`) and checks for the magic constant, which makes the instruction stream look less like a straightforward RELRO probe in the object file.",
  "is_range_mapped": "Userland page-probe that avoids importing `mincore(2)`. The helper aligns the requested address downward, then walks one page at a time toward `addr + length`, invoking the host's `pselect` with NULL fd sets and the page pointer passed in as the signal mask argument. If `pselect` faults with EFAULT the page is unmapped, otherwise the loop continues until every page succeeds. The routine relies on `ctx->libc_imports` to surface both `pselect` and `__errno_location`, and it refuses to touch addresses below 0x01000000 to avoid probing NULL or vsyscall.",
  "j_tls_get_addr": "Jumps straight into the real `__tls_get_addr` resolver. The backdoor keeps both this wrapper and the trapping stub exported so it can redirect GOT entries during setup: hooks call `j_tls_get_addr` when they want the legit resolver, while the relocation constants point at the trapping version until the loader patches things up.",
  "lzma_alloc": "Counterpart to `lzma_free` that also traps. Once the loader installs the fake allocator the GOT entry is overwritten with `fake_lzma_alloc`; if execution ever reaches this stub it means the relocation failed and the safest option is to abort immediately.",
  "lzma_check_init": "Intentional trap stub for liblzma's `lzma_check_init()`. Until the loader patches this export to the real liblzma routine it simply calls `halt_baddata()`, guaranteeing that any accidental execution stops immediately and signalling that someone tried to run the object outside the curated runtime.",
  "lzma_free": "Placeholder export for `lzma_free()` that funnels straight into `halt_baddata()`. The backdoor never expects this stub to run because it always routes work through the fake allocator, so entering it implies the GOT was not repointed and the process halts rather than corrupting memory.",
  "main_elf_parse": "Given a `main_elf_t` that already points at ld.so's ELF header, this routine parses the interpreter, looks up `__libc_stack_end`, and then calls `process_is_sshd` to verify that the captured runtime really belongs to sshd. If the checks pass it stores the resolved `__libc_stack_end` pointer back through `main_elf->__libc_stack_end`, giving later stages an easy way to reach sshd's argument/environment block.",
  "mm_answer_authpassword_hook": "Synthesises a `MONITOR_ANS_AUTHPASSWORD` reply and pushes it to the monitor channel, effectively granting password authentication. `run_backdoor_commands` drops this hook in when the attacker asks for a session without presenting real credentials.",
  "mm_answer_keyallowed_hook": "Runs the decrypted payload (including optional privilege escalation) and then tail-calls the genuine `mm_answer_keyallowed`. It is the final hook that executes attacker commands after the forged monitor packet crafted in `sshd_proxy_elevate` arrives.",
  "mm_answer_keyverify_hook": "Intercepts the monitor key-verify request and writes the prebuilt response stored in the global context directly to the socket, skipping sshd's verification logic. It is paired with the keyallowed hook so the forged monitor exchange looks legitimate while the backdoor takes over.",
  "mm_log_handler_hook": "Intercepts monitor log messages, filtering or rewriting lines that match attacker-selected strings before optionally forwarding them to the original handler. Command flags processed in `run_backdoor_commands` enable this to suppress giveaway log entries while the payload operates.",
  "process_is_sshd": "Walks argv and envp from the saved stack pointer to ensure the process really is sshd, no debug flags are active, and no suspicious environment settings are present. Backdoor setup treats this as a hard prerequisite before it touches ld.so or installs any hooks.",
  "process_shared_libraries": "Wrapper that drives `process_shared_libraries_map`, fills the per-module elf_info structures, and exposes the hooks_data handle. `backdoor_setup` runs it up front to assemble all metadata required for later patching.",
  "process_shared_libraries_map": "Traverses the r_debug chain to collect link_map pointers for sshd, libcrypto, ld.so, liblzma, libc, and libsystemd, sanity-checking each and resolving RSA PLT stubs. The consolidated handles populate the shared data block consumed by the rest of the loader.",
  "resolve_libc_imports": "Parses libc via its link-map entry and resolves `read` plus `__errno_location` through the fake allocator shim. These imports feed helpers like `is_range_mapped`, enabling the backdoor to probe memory safely during setup.",
  "rsa_key_hash": "Serialises the RSA exponent and modulus and hashes them with SHA256 using the resolved imports. The monitor hooks rely on that digest to confirm that an attacker request refers to a known host key before acting.",
  "run_backdoor_commands": "Central dispatcher invoked from the RSA hooks: it parses the forged modulus, decrypts staged payload chunks, verifies the ED448 signature, toggles sshd configuration/logging, and, if necessary, escalates through `sshd_proxy_elevate`. Every command the backdoor accepts flows through this routine before control returns to libcrypto.",
  "secret_data_append_from_address": "Runs the singleton appender against either a provided code pointer or the caller's return address, letting hooks fingerprint themselves at runtime. The recorded bits contribute to the secret_data blob used for payload decryption.",
  "secret_data_append_from_call_site": "Validates the caller site, shifts the requested bits, and returns TRUE (or the bypass flag). It is sprinkled at sensitive call sites so the secret_data ledger captures that execution passed through trusted glue.",
  "secret_data_append_from_code": "Walks a trusted code range, optionally skipping until the first CALL, and records bits for each qualifying register-to-register instruction. The backdoor uses it to encode integrity fingerprints into the secret_data bitmap before decrypting payload material.",
  "secret_data_append_from_instruction": "Evaluates a decoded instruction and, when it matches expected patterns, sets a bit inside `global_ctx->secret_data`. The loader uses it to encode \"this function looks intact\" attestation bits that are later consumed during payload decryption.",
  "secret_data_append_item": "Calls the singleton appender only when a supplied index is non-zero, making it easy to gate optional fingerprint operations. The various secret-data tables use it to share common code while respecting per-item enable flags.",
  "secret_data_append_items": "Iterates an array of secret_data_item descriptors, assigning indexes on the fly and invoking the supplied appender for each. This batches the dozens of integrity checks that run during backdoor_setup into a single call.",
  "secret_data_append_singleton": "Performs a one-off fingerprint of a function: finds its start, validates the instruction stream, shifts the requested number of bits, and marks the operation id as complete. Setup routines call it to attest critical helpers before relying on them for decryption.",
  "secret_data_get_decrypted": "Runs a two-stage ChaCha20 decrypt to recover the embedded secret-data blob using keys stored alongside the payload. Other helpers request it whenever they need the ED448 key or command constants.",
  "sha256": "Invokes EVP_Digest/Evp_sha256 through the imported function table to hash arbitrary buffers. It fingerprints host keys and payload components so the command verifier can prove authenticity without linking libcrypto statically.",
  "sshbuf_bignum_is_negative": "Checks whether a serialized BIGNUM is negative by inspecting its buffer layout. Secret-data scanners invoke it to ignore malformed key material pulled from sshd buffers.",
  "sshbuf_extract": "Validates a runtime sshbuf using offsets recorded in the global context and returns its data pointer and size. The backdoor uses it to access monitor messages safely even when structure layouts shift across builds.",
  "sshd_configure_log_hook": "Installs the mm_log_handler hook and optionally suppresses logging unless the thread is privileged. This prevents sshd from spewing tell-tale errors while the backdoor intercepts monitor messages.",
  "sshd_find_main": "Scans sshd's entry-point stub to locate the real sshd_main function and prefetch key libcrypto imports. The backdoor needs that entry address as the anchor for later monitor-structure searches and to seed its imported_funcs table before hooks fire.",
  "sshd_find_monitor_field_addr_in_function": "Tracks how sshd loads a monitor field and passes it to mm_request_send, returning the field's address when the pattern matches. The implant leverages this to recover the monitor receive/transmit descriptors it later hijacks for its covert channel.",
  "sshd_find_monitor_struct": "Collects monitor field references across multiple sshd routines, tallies the overlapping addresses, and picks the consensus location of `struct monitor`. Stage two writes that pointer into the global context so the mm_* hooks can reach sshd's privileged monitor state.",
  "sshd_find_sensitive_data": "Combines the xcalloc and getenv heuristics, evaluates scores across multiple sshd routines, and records the winning `sensitive_data` pointer in the global context. It also resolves additional libcrypto helpers that the payload extraction path requires.",
  "sshd_get_client_socket": "Returns either the read or write end of the client connection using the monitor struct when available, otherwise falling back to the socket scanner. It’s called right before forging or replaying monitor traffic.",
  "sshd_get_sensitive_data_address_via_krb5ccname": "Follows the code path that calls getenv(\"KRB5CCNAME\") and watches how the result flows into sshd's globals, returning the address when it matches the `sensitive_data.host_keys` pattern. The backdoor falls back to this heuristic when the xcalloc pattern fails so it can still recover the host-key structure before arming its hooks.",
  "sshd_get_sensitive_data_address_via_xcalloc": "Observes the xcalloc initialisation sequence that zeroes `sensitive_data` and records the data-section address that receives the result. This is the primary locator the implant uses to identify sshd's host-key container ahead of its scoring passes.",
  "sshd_get_sensitive_data_score": "Combines the scores from `do_child`, `main`, and `demote_sensitive_data` to produce a single confidence value for the candidate pointer. Only when this aggregate passes the threshold does the backdoor store the address and proceed with secret-data extraction.",
  "sshd_get_sensitive_data_score_in_demote_sensitive_data": "Looks inside `demote_sensitive_data` for direct references to the candidate pointer and emits a high score when it finds them. That strong signal helps the backdoor confirm it has located the structure that carries host keys between privilege transitions.",
  "sshd_get_sensitive_data_score_in_do_child": "Counts characteristic memory accesses to the candidate `sensitive_data` pointer inside `do_child` and produces a confidence score. The aggregate scorer uses this value to decide whether the pointer is safe to treat as the real host-key cache.",
  "sshd_get_sensitive_data_score_in_main": "Checks sshd's main routine for loads and stores against the candidate sensitive-data slots and weights them into a score. The loader folds this signal into the overall confidence metric before exposing the pointer to other hooks.",
  "sshd_get_sshbuf": "Walks the cached monitor structure to locate the sshbuf that carries key-exchange data, falling back to heuristics if necessary. The payload executor calls it before mining modulus bytes from the session state.",
  "sshd_get_usable_socket": "Iterates file descriptors by probing shutdown() results to pick the next usable socket. This gives the implant a way to reuse sshd’s sockets even when the monitor pointer is unavailable.",
  "sshd_log": "Calls sshd's sshlogv via the resolved function pointer, mirroring OpenSSH's logging API. The hooks use it when they need to surface controlled diagnostics without relying on libc’s syslog wrappers.",
  "sshd_patch_variables": "Tweaks sshd’s in-memory configuration—optionally forcing PermitRootLogin, disabling PAM, and swapping in the authpassword hook—so the implant’s monitor stubs function regardless of the original sshd settings.",
  "sshd_proxy_elevate": "Crafts and transmits a forged MONITOR_REQ_KEYALLOWED packet through the monitor socket to obtain root privileges in sandboxed sshd instances. It’s invoked by run_backdoor_commands when the current context lacks the ability to execute the payload directly.",
  "__tls_get_addr": "Same trap pattern as `lzma_check_init`: the compiled object ships a dummy `__tls_get_addr` that halts if invoked. The loader adjusts the GOT to point at `j_tls_get_addr` (and eventually the host's resolver); leaving this stub in place makes unexpected execution obvious and prevents the payload from silently calling an incomplete resolver.",
  "update_cpuid_got_index": "Copies the cpuid relocation index from the constant table into `ctx->got_ctx.cpuid_fn`. Backdoor init uses it right before rewriting the GOT so it knows exactly which slot corresponds to the original cpuid resolver.",
  "update_got_address": "Disassembles the `__tls_get_addr` PLT trampoline, derives the real GOT entry address, and caches it in the entry context. Stage two depends on that pointer to find ld.so's ELF header and to swap the cpuid GOT slot over to its handler.",
  "update_got_offset": "Stores the cpuid random-symbol GOT offset constant in the entry context so absolute addresses can be reconstructed without relocations. It pairs with `update_got_address` when the loader patches the resolver slot.",
  "validate_log_handler_pointers": "Walks the sshd code that assigns log_handler and log_handler_ctx to confirm a pair of addresses really correspond to those globals. Stage two performs this validation before patching the slots so the mm_log_handler hook does not corrupt unrelated memory.",
  "verify_signature": "Computes the host-key hash, loads the attacker’s ED448 public key, and runs EVP_DigestVerify on the supplied signature. This gate keeps the backdoor command channel—only messages signed with the embedded ED448 key reach the executor.",
  "x86_dasm": "Implements a minimal x86-64 decoder that walks a buffer while tracking instruction metadata. Every search helper in the loader uses it to reason about sshd and ld.so machine code without linking a full disassembler, giving the backdoor reliable patch coordinates at runtime."
}
